app/controllers/shipments_controller.rb

  def index
    @hawbs = Shipment.all.map &:hawb
    @shipments = Shipment.search(params[:shipment]).page(params[:page]).per(20)
---
SELECT `shipments`.* FROM `shipments`
SELECT `shipments`.* FROM `shipments` WHERE (1=2) LIMIT 20 OFFSET 0